--------------- SELECT 함수 실습문제 ----------------------

-- 1. 시스템으로 부터 오늘 날짜에 대한 정보를 조회하는 구문 작성

   
-- 2. EMP 테이블로 부터 사번, 사원명, 급여 조회
--    단, 급여는 100단위 까지의 값만 출력 처리함.
--    급여 기준 내림차순 정렬함.


-- 3. EMP 테이블로 부터 사원번호가 홀수인 사원들을 조회


-- 4. EMP 테이블로 부터 사원명, 입사일 조회
--    단, 입사일은 년도와 월을 분리 추출해서 출력


-- 5. EMP 테이블로 부터 9월에 입사한 직원의 정보 조회


-- 6. EMP 테이블로 부터 '81'년도에 입사한 직원 조회


-- 7. EMP 테이블로 부터 이름이 'E'로 끝나는 직원 조회


-- 8. EMP 테이블로 부터 이름의 세번째 글자가 'R'인 직원의 정보 조회
-- >> LIKE 연산자를 사용

-- >> SUBSTR() 함수 이용


-- 9. EMP 테이블로 부터 사번, 사원명, 입사일, 그리고 입사일로부터 40년후의 날짜 조회
     

-- 10. 입사일로 현재날짜까지 40년 이상 근무한 직원의 정보 조회


